Revit 2027 API
PhotometricWebLightDistribution.PhotometricWebFile Property
 The filename of an IES photometric web file.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PhotometricWebFile { get; set; }
Public Property PhotometricWebFile As String
	Get
	Set
public:
property String^ PhotometricWebFile {
	String^ get ();
	void set (String^ value);
}
member PhotometricWebFile : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
PhotometricWebLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace